HPC motorbike/Small/v1912/system/mirrorMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mirrorMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeType           pointAndNormal; // planeEquation // embeddedPoints

pointAndNormalDict
{
    basePoint       (0 4 0);
    normalVector    (0 1 0);
}

// Plane equation: ax + by + cz + d = 0
planeEquationDict
{
    a   0;
    b   1;
    c   0;
    d   0;
}

embeddedPointsDict
{
    point1  (0 0 0);
    point2  (1 0 0);
    point3  (0 0 1);
}

planeTolerance  1e-3;

// ************************************************************************* //
